Revit 2027 API
ExternalResourceServiceUtils Class
 Contains utilities related to external resource service.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceServiceUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExternalResourceServiceUtils
Public NotInheritable Class ExternalResourceServiceUtils
public ref class ExternalResourceServiceUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceServiceUtils = class end
The ExternalResourceServiceUtils type exposes the following members.
Methods
Name | Description
GetServersByType |  Gets registered external resource servers which support the external resource type.
Top
See Also
Reference
Autodesk.Revit.DB Namespace